// js/heroes-by-castle.js
// Карта "замок → герои"
window.heroesByCastle = {
  "Замок": ["Оррин", "Валеска", "Эдрик", "Сорша", "Тирис", "Адель", "Катберт", "Аделаида", "Лойнис", "Кейтлин"],
  "Оплот": ["Мефала", "Уфретин", "Енова", "Риланд", "Торгрим", "Ивор", "Клэнси", "Эллешар", "Алагар", "Аэрис"],
  "Башня": ["Пикедрам", "Тан", "Жозефина", "Нила", "Фафнер", "Ризза", "Астрал", "Теодор", "Солмир", "Айне"],
  "Инферно": ["Фиона", "Рашка", "Мариус", "Игнат", "Октавия", "Калх", "Нимус", "Ксирон", "Калид", "Аш"],
  "Некрополис": ["Стракер", "Вокиал", "Моандор", "Чарна", "Тамика", "Клавий", "Галтран", "Септиенна", "Тант", "Видомина"],
  "Темница": ["Лорелей", "Дас", "Аджит", "Дамакон", "Синка", "Шакти", "Малекит", "Джеддит", "Димер", "Сефинрот"],
  "Цитадель": ["Йог", "Жабаркас", "Шива", "Гретчин", "Тираксор", "Вей", "Терек", "Зубин", "Гундула", "Сауруг"],
  "Крепость": ["Брон", "Дрэйкон", "Вистан", "Тазар", "Алкин", "Корбак", "Брохильд", "Вердиш", "Стиг", "Адриэн"],
  "Сопряжение": ["Пасис", "Тунар", "Лакус", "Фьюр", "Луна", "Брисса", "Циэль", "Лабета", "Анаин", "Гриндан"],
  "Причал": ["Коркес", "Джереми", "Иллор", "Дерек", "Анабель", "Кассиопея", "Касметра", "Эоваций", "Андал", "Зилар"],
  "Фабрика": ["Генриетта", "Сэм", "Танкред", "Дьюри", "Мёрдок", "Селестина", "Тодд", "Агар", "Бертрам", "Зиф"]
};
